Revit 2027 API
SynchronizeWithCentralOptions.Compact Property
 Indicates whether Revit should compact the central model while synchronizing with central. This option reduces the size of the central model but many increase the time it takes to perform the save. False by default.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Compact { get; set; }
Public Property Compact As Boolean
	Get
	Set
public:
property bool Compact {
	bool get ();
	void set (bool value);
}
member Compact : bool with get, set
Property Value
Boolean
See Also
Reference
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace